<template>
	<view>
	<!-- 🔥选择框 -->
	<view class="">
		<u-dropdown>
			<u-dropdown-item v-model="selection" :title="options1[0].label" :options="options1"></u-dropdown-item>
		</u-dropdown>
	</view>
		<!-- 🔥搜索框 -->
		<u-search placeholder="你想搜的内容" v-model="keyword"></u-search>
		<!-- 🔥获取数据 -->
		
		<!-- 🔥循环数据 -->
		<block v-for="(card,index) in cards" :key="index">
				<view class="cu-list menu-avatar comment solids-top">
					<view class="cu-item">
						<view class="cu-avatar round" style="background-image:url(https://ossweb-img.qq.com/images/lol/img/champion/Morgana.png);"></view>
						<view class="content">
							<view class="text-grey">承包单位：{{card.施工总承包单位名称}}</view>
							<view class="text-gray text-content text-df">工程造价 ：{{card.工程造价}}</view>
							<view class="text-gray text-content text-df">施工单位 ：{{card.施工总承包单位名称}}</view>
							
							<view class="bg-grey padding-sm radius margin-top-sm  text-sm">
								<view class="flex">
									<view>工程名称：</view>
									<view class="flex-sub">{{card.工程项目名称}}</view>
									</view>
									<view class="flex">
									<view>项目许可号：</view>
									<view class="flex-sub">{{card.施工许可证号}}</view>
								</view>
							</view>

							<view class="margin-top-sm flex justify-between">
								<view class="text-gray text-df">开工日期:{{card.开工日期}}</view>
							</view>
						</view>
					</view>
				</view>
		</block>
				
	</view>
</template>

<script>
	export default {
		data() {
			return {
				//选择
			    selection: 1,
				options1: [{
						label: '浙江在建工地信息',
						value: 1,
					},
					{
						label: '浙江在建工程信息',
						value: 2,
					},
					{
						label: '最新招标信息',
						value: 3,
					}
				],
				//搜索
				keyword: '',
				//卡片
				cardTittle: '卡片内容',
				
				cards: [
				{
                    "mID": 1,
                    "工程造价(万元)": "2000",
                    "工程项目名称": "永康市桃花源农业观光旅游度假区D-01地块建设项目",
                    "建设单位名称": "永康市桃花源农业开发有限公司",
                    "建设单位统一社会信用代码": "91330784597215142M",
                    "开工日期": "2019-10-19",
                    "所属区县": "330784",
                    "所属市": "330700",
                    "施工总承包单位名称": "浙江紫微建筑工程有限公司",
                    "施工总承包单位统一社会信用代码": "913307842550741838",
                    "施工许可证号": "330784201910180101",
                    "项目地址": "永康市桃花源农业观光旅游度假区D-01地块",
                    "项目经理": "吕宏巍",
                    "项目基本信息主键ID": "93767686-afe7-4c27-b9f7-70f31e73d081",
                    "发证时间": "2019/10/18"
                },
				{
				    "mID": 1,
				    "工程造价（万元）": "2000",
				    "工程项目名称": "永康市桃花源农业观光旅游度假区D-01地块建设项目",
				    "建设单位名称": "永康市桃花源农业开发有限公司",
				    "建设单位统一社会信用代码": "91330784597215142M",
				    "开工日期": "2019-10-19",
				    "所属区县": "330784",
				    "所属市": "330700",
				    "施工总承包单位名称": "浙江紫微建筑工程有限公司",
				    "施工总承包单位统一社会信用代码": "913307842550741838",
				    "施工许可证号": "330784201910180101",
				    "项目地址": "永康市桃花源农业观光旅游度假区D-01地块",
				    "项目经理": "吕宏巍",
				    "项目基本信息主键ID": "93767686-afe7-4c27-b9f7-70f31e73d081",
				    "发证时间": "2019/10/18"
				},
				{
				    "mID": 1,
				    "工程造价（万元）": "2000",
				    "工程项目名称": "永康市桃花源农业观光旅游度假区D-01地块建设项目",
				    "建设单位名称": "永康市桃花源农业开发有限公司",
				    "建设单位统一社会信用代码": "91330784597215142M",
				    "开工日期": "2019-10-19",
				    "所属区县": "330784",
				    "所属市": "330700",
				    "施工总承包单位名称": "浙江紫微建筑工程有限公司",
				    "施工总承包单位统一社会信用代码": "913307842550741838",
				    "施工许可证号": "330784201910180101",
				    "项目地址": "永康市桃花源农业观光旅游度假区D-01地块",
				    "项目经理": "吕宏巍",
				    "项目基本信息主键ID": "93767686-afe7-4c27-b9f7-70f31e73d081",
				    "发证时间": "2019/10/18"
				}
				
				],
			}
		},
		methods: {
			
		},
		
		onLoad: function(options) {
			uni.request({
			    url: 'https://test-server.build-dream.cn/api/project/information', //仅为示例，并非真实接口地址。
			    data: {
			        text: 'uni.request'
			    },
			    header: {
			        //'custom-header': 'hello' //自定义请求头信息
			    },
			    success: (res) => {
			        
			        console.log(res.data.data.items.data);
					this.cards=res.data.data.items.data;
			    }
			});
		},
	}
</script>

<style>

</style>
